MAX_RATE = 5
ITEM_PER_PAGE = 2

EXERCISES = {
    "upperArms": {
        "name": "上腕(二頭・三頭)",
        "exercises": [
            "アームカール",
            "トライセプスエクステンション",
            "ディップス",
            "ケーブルプッシュダウン",
            "ダイヤモンドプッシュアップ"
        ]
    },
    "lowerBody": {
        "name": "下半身(脚・臀部)",
        "exercises": [
            "スクワット",
            "ブルガリアンスクワット",
            "ランジ",
            "レッグプレス",
            "レッグエクステンション",
            "レッグカール",
            "シシースクワット",
            "ステップアップ",
            "カーフレイズ",
            "ヒップブリッジ",
            "ヒップスラスト",
            "ドンキーキック",
            "ファイアハイドラント",
            "レッグアダクション",
            "レッグアブダクション",
            "グッドモーニング"
        ]
    },
    "core": {
        "name": "体幹・腹筋",
        "exercises": [
            "クランチ",
            "シットアップ",
            "レッグレイズ",
            "ロシアンツイスト",
            "プランク",
            "サイドプランク",
            "フラッターキック",
            "マウンテンクライマー",
            "ドラゴンフラッグ",
            "アブローラー",
            "デッドバグ"
        ]
    },
    "back": {
        "name": "背中",
        "exercises": [
            "デッドリフト",
            "ラットプルダウン",
            "ローイング",
            "ベントオーバーロウ",
            "ワンハンドロウ",
            "懸垂",
            "フェイスプル",
            "シュラッグ",
            "バックエクステンション",
            "スーパーマン"
        ]
    },
    "chest": {
        "name": "胸・プッシュ系",
        "exercises": [
            "ベンチプレス",
            "チェストプレス",
            "ダンベルフライ",
            "ペックフライ",
            "インクラインプレス",
            "プッシュアップ",
            "ケーブルクロスオーバー"
        ]
    },
    "cardio": {
        "name": "有酸素・全身",
        "exercises": [
            "ウォーキング",
            "ランニング",
            "バーピー",
            "ジャンピングジャック",
            "ハイニー",
            "バットキック",
            "インチワーム",
            "ベアクロール",
            "クラブウォーク",
            "スケーター"
        ]
    },
    "martialArts": {
        "name": "格闘・コンディショニング",
        "exercises": [
            "シャドーボクシング",
            "キックボクシング",
            "サンドバッグ打ち",
            "エアキック"
        ]
    },
    "bodyCare": {
        "name": "ボディケア・調整",
        "exercises": [
            "ヨガ",
            "ピラティス",
            "ストレッチ",
            "体操",
            "太極拳"
        ]
    },
    "aquatic": {
        "name": "水中運動",
        "exercises": [
            "水泳",
            "水中ウォーキング",
            "水中エアロビクス"
        ]
    },
    "sports": {
        "name": "スポーツ",
        "exercises": [
            "テニス",
            "バドミントン",
            "卓球",
            "バスケットボール",
            "サッカー",
            "バレーボール",
            "野球",
            "ボウリング"
        ]
    },
    "others": {
        "name": "その他",
        "exercises": [
            "その他"
        ]
    }
}